kdmukAI-bot/esp-board-common/boards/elecrow_crowpanel_adv_p4_50/sdkconfig.defaults
# Elecrow CrowPanel Advance 5" ESP32-P4
CONFIG_IDF_TARGET="esp32p4"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_SPIRAM=y
CONFIG_SPIRAM_SPEED_200M=y
CONFIG_SPIRAM_XIP_FROM_PSRAM=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y

# L2 cache sizing for the RGB framebuffers in PSRAM
CONFIG_CACHE_L2_CACHE_256KB=y
CONFIG_CACHE_L2_CACHE_LINE_128B=y

# FreeRTOS tick rate (needed for smooth LVGL rendering)
CONFIG_FREERTOS_HZ=1000

CONFIG_ESP_MAIN_TASK_STACK_SIZE=10240

# Required for some ESP32-P4 peripheral features
CONFIG_IDF_EXPERIMENTAL_FEATURES=y

# Disable power management. Beyond the clock-gating issues it causes elsewhere,
# an RGB panel is especially unforgiving: its pixel stream is continuous, so any
# APB frequency change mid-frame shears the image.
CONFIG_PM_ENABLE=n

# Console: this board has a CH340K USB-UART bridge (it enumerates as
# /dev/ttyUSB*, not the P4's native USB-Serial-JTAG), so the console stays on
# UART0 — the IDF default.

# Orientation: CONFIG_BOARD_LANDSCAPE is deliberately NOT set. That flag means
# "rotate a portrait panel 90 degrees to render landscape"; this panel is
# already landscape (800x480), so setting it would swap BOARD_DISP_H_RES /
# BOARD_DISP_V_RES to 480x800 and misplace everything sized from them.
